# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  # RGB Net
0   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2      
1   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4     
2   - [-1, 3, C2f, [128, True]] #  2          
3   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8     
4   - [-1, 6, C2f, [256, True]] # 4           
5   - [[-1, -1], 1, Concat, [1]] # new        
6   - [-1, 1, Conv, [256, 3, 1]] # new        
7   - [-3, 1, SCDown, [512, 3, 2]] # 5-P4/16  
8   - [-1, 6, C2f, [512, True]] # 6           
9   - [[-1, -1], 1, Concat, [1]] # new        
10  - [-1, 1, Conv, [512, 3, 1]] # new        
11  - [-3, 1, SCDown, [1024, 3, 2]] # 7-P5/32 
12  - [-1, 3, C2fCIB, [1024, True, True]] # 8 
13  - [-1, 1, SPPF, [1024, 5]] # 9            
14  - [-1, 1, PSA, [1024]] # 10               
15  - [[-1, -1], 1, Concat, [1]] # new        
16  - [-1, 1, Conv, [1024, 3, 1]] # new       
  # Radar Net

# YOLOv8.0n head
head:
17  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 
18  - [[-1, 10], 1, Concat, [1]] # cat backbone P4    
19  - [-1, 3, C2f, [512]] # 13                        

20  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 
21  - [[-1, 6], 1, Concat, [1]] # cat backbone P3     
22  - [-1, 3, C2f, [256]] # 16 (P3/8-small)           

23  - [-1, 1, Conv, [256, 3, 2]] #                    
24  - [[-1, 19], 1, Concat, [1]] # cat head P4        
25  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)         

26  - [-1, 1, SCDown, [512, 3, 2]] #                  
27  - [[-1, 16], 1, Concat, [1]] # cat head P5        
28  - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)    

29  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)   
