# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2      0
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4     1
  - [-1, 3, C2f, [128, True]] #  2          2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8     3
  - [-1, 6, C2f, [256, True]] # 4           4
  - [-1, 1, RVFF, [256]] # new              5
  - [-2, 1, SCDown, [512, 3, 2]] # 5-P4/16  6
  - [-1, 6, C2f, [512, True]] # 6           7
  - [-1, 1, RVFF, [512]] # new              8
  - [-2, 1, SCDown, [1024, 3, 2]] # 7-P5/32 9
  - [-1, 3, C2fCIB, [1024, True, True]] # 8 10
  - [-1, 1, SPPF, [1024, 5]] # 9            11
  - [-1, 1, PSA, [1024]] # 10               12
  - [-1, 1, RVFF, [1024]] # new             13

# YOLOv8.0n head
head:
  - [-2, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4     15
  - [-1, 3, C2f, [512]] # 13                        16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 17
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3     18
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)           19

  - [-1, 1, Conv, [256, 3, 2]] #                    20
  - [[-1, 16], 1, Concat, [1]] # cat head P4        21
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)         22
  - [-1, 1, SCDown, [512, 3, 2]] #                  23
  - [[-1, 13], 1, Concat, [1]] # cat head P5        24
  - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)    25

  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)   26
